certora/mutations/participants_strictBank/bug11.patch
diff --git a/contracts/bank/StrictBank.sol b/contracts/bank/StrictBank.sol
index 49a8e6b..c9009a8 100644
--- a/contracts/bank/StrictBank.sol
+++ b/contracts/bank/StrictBank.sol
@@ -29,7 +29,7 @@ contract StrictBank is Bank {
     // @dev records a token transfer into the contract
     // @param token the token to record the transfer for
     // @return the amount of tokens transferred in
-    function recordTransferIn(address token) external onlyController returns (uint256) {
+    function recordTransferIn(address token) external payable onlyController returns (uint256) {
         return _recordTransferIn(token);
     }
 
